let data = [
  {
    "年份": "2018",
    "总人数": 304,
    "学历结构": {
      "硕士学位": {
        "总人数": 110,
        "护理岗": {
          "初级": 2,
          "副高": 1,
          "中级": 3,
          "正高": 2,
          "总数": 2,
          "其他": 1
        },
        "检验岗": {
          "初级": 2,
          "副高": 2,
          "中级": 3,
          "正高": 64,
          "总数": 56,
          "其他": 1
        },
        "医技（药剂）岗": {
          "初级": 2,
          "副高": 3,
          "中级": 1,
          "正高": 3,
          "总数": 1,
          "其他": 4
        },
        "医疗岗": {
          "初级": 3,
          "副高": 2,
          "中级": 1,
          "正高": 4,
          "总数": 5,
          "其他": 0
        },
        "科研岗": {
          "初级": 3,
          "副高": 1,
          "中级": 4,
          "正高": 3,
          "总数": 1,
          "其他": 2
        }
      },
      "博士学位": {
        "总人数": 3,
        "护理岗": {
          "初级": 2,
          "副高": 12,
          "中级": 3,
          "正高": 3,
          "总数": 1,
          "其他": 2
        },
        "检验岗": {
          "初级": 3,
          "副高": 2,
          "中级": 4,
          "正高": 1,
          "总数": 2,
          "其他": 2
        },
        "医技（药剂）岗": {
          "初级": 3,
          "副高": 2,
          "中级": 4,
          "正高": 3,
          "总数": 1,
          "其他": 2
        },
        "医疗岗": {
          "初级": 3,
          "副高": 2,
          "中级": 1,
          "正高": 2,
          "总数": 3,
          "其他": 2
        },
        "科研岗": {
          "初级": 3,
          "副高": 2,
          "中级": 3,
          "正高": 1,
          "总数": 2,
          "其他": 2
        }
      },
      "学士学位": {
        "总人数": 0,
        "护理岗": {
          "初级": 1,
          "副高": 3,
          "中级": 2,
          "正高": 2,
          "总数": 3,
          "其他": 3
        },
        "检验岗": {
          "初级": 2,
          "副高": 1,
          "中级": 2,
          "正高": 2,
          "总数": 3,
          "其他": 3
        },
        "医技（药剂）岗": {
          "初级": 3,
          "副高": 3,
          "中级": 1,
          "正高": 2,
          "总数": 3,
          "其他": 2
        },
        "医疗岗": {
          "初级": 3,
          "副高": 2,
          "中级": 1,
          "正高": 4,
          "总数": 2,
          "其他": 2
        },
        "科研岗": {
          "初级": 3,
          "副高": 12,
          "中级": 2,
          "正高": 1,
          "总数": 2,
          "其他": 3
        }
      },
      "其他": {
        "总人数": 1,
        "护理岗": {
          "初级": 1,
          "副高": 2,
          "中级": 4,
          "正高": 2,
          "总数": 142,
          "其他": 5
        },
        "检验岗": {
          "初级": 4,
          "副高": 1,
          "中级": 2,
          "正高": 3,
          "总数": 2,
          "其他": 1
        },
        "医技（药剂）岗": {
          "初级": 3,
          "副高": 2,
          "中级": 1,
          "正高": 2,
          "总数": 3,
          "其他": 2
        },
        "医疗岗": {
          "初级": 2,
          "副高": 1,
          "中级": 4,
          "正高": 1,
          "总数": 3,
          "其他": 5
        },
        "科研岗": {
          "初级": 2,
          "副高": 1,
          "中级": 4,
          "正高": 0,
          "总数": 14,
          "其他": 5
        }
      }
    },
    "科室": "病理科",
    "编号": 19
  }
]

console.log(data[0]["学历结构"]['硕士学位'])